Tekla.Structures.TeklaStructuresInternal.EventHandler
EventHandler is a class that TS calls when an event is raised. Handler
then calls all the listener "Events" objects.

Tekla.Structures.TeklaStructuresInternal.EventHandler.EventListeners
List of Events objects waiting to be called

Tekla.Structures.TeklaStructuresInternal.EventHandler.AddListener(Tekla.Structures.TeklaStructuresInternal.Events)
EventListener:

Tekla.Structures.TeklaStructuresInternal.EventHandler.RemoveListener(Tekla.Structures.TeklaStructuresInternal.Events)
EventListener:

Tekla.Structures.TeklaStructuresInternal.EventHandler.OnEvent(System.String)
TS calls when event is raised.
Param: Name of the event
Returns: 1